app/controllers/admin/rodas_controller.rb

  def index
    @rodas = Roda.all
---
SELECT "rodas".* FROM "rodas"

  def create
    @roda = Roda.new(roda_params)
    if @roda.save
---
INSERT INTO "rodas" ("titulo", "descricao", "preco", "imagem", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @roda.update(roda_params)
---
UPDATE "rodas" SET "updated_at" = $1 WHERE "rodas"."id" = $2  [["updated_at", "2024-11-26 02:49:59.724107"], ["id", 1]]

  def set_roda
    @roda = Roda.find(params[:id])
---
SELECT "rodas".* FROM "rodas" WHERE "rodas"."id" = $1  [["id", 1]]