app/controllers/home_controller.rb

SELECT "testimonials".* FROM "testimonials"
SELECT "services".* FROM "services"
SELECT "technicians".* FROM "technicians"
---
  def index
    @testimonials = Testimonial.all
    @services = Service.all
    @technicians = Technician.all

SELECT "rodas".* FROM "rodas"
---
  def services

    # Fazendo a busca com Ransack
    @q = Roda.ransack(params[:q])

    # Verificando se o filtro de categoria foi deixado em branco ou se foi selecionada "Todas"
    if params[:q] && params[:q][:categoria_eq].blank?
      @rodas = Roda.all  # Caso a categoria seja "Todas" ou não tenha sido selecionada